app/controllers/plans_controller.rb

  def index
    @plans = Plan.order(created_at: :desc)
---
SELECT "plans".* FROM "plans" ORDER BY "plans"."created_at" DESC

  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("title", "content", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "スケジュールアプリ"], ["content", ""], ["start_time", nil], ["created_at", "2026-03-16 10:13:04.920924"], ["updated_at", "2026-03-16 10:13:04.920924"]]

  def update
    respond_to do |format|
      if @plan.update(plan_params)
---
UPDATE "plans" SET "content" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["content", "ああああああああええええ"], ["updated_at", "2026-03-16 20:58:02.060750"], ["id", 4]]

  def destroy
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 3]]